import csv
import pandas as pd


# 데이터 정의
data = [
    ["선수명", "구단", "경기", "타율", "타수", "안타", "2루타", "3루타", "홈런", "타점", "도루", "수비율", "실책", "자살", "보살", "비고"],
    ["김원섭", "KIA", 101, 0.301, 356, 107, 14, 9, 8, 43, 20, 1.000, 0, 185, 7, "타격15위"],
    ["박재상", "SK", 133, 0.295, 515, 152, 31, 4, 15, 81, 33, 0.972, 6, 197, 8, "도루6위, 최다안타 공동6위, 득점 공동10위, 타격19위"],
    ["김현수", "두산", 133, 0.357, 482, 172, 31, 6, 23, 104, 6, 0.989, 2, 177, 10, "최다안타1위, 타점2위, 타격/득점/출루율/장타율3위"],
    ["강봉규", "삼성", 126, 0.310, 449, 139, 24, 2, 20, 78, 20, 0.977, 4, 166, 7, "득점6위, 타격/출루율10위"],
    ["이택근", "히어로즈", 123, 0.311, 456, 142, 26, 0, 15, 66, 43, 0.980, 4, 190, 4, "도루3위, 타격8위, 출루율/최다안타9위, 득점 공동10위"],
    ["클락", "히어로즈", 125, 0.290, 486, 141, 24, 4, 24, 90, 23, 0.981, 5, 245, 10, "타점7위, 득점9위, 홈런 공동9위, 도루10위, 최다안타 공동10위, 타격23위"],
    ["박용택", "LG", 111, 0.372, 452, 168, 31, 5, 18, 74, 22, 0.983, 3, 170, 7, "타격1위, 최다안타 공동2위, 득점/장타율5위, 출루율8위"],
    ["이대형", "LG", 133, 0.280, 521, 146, 10, 2, 2, 41, 64, 0.988, 4, 330, 10, "도루1위, 득점4위, 최다안타8위"],
    ["이진영", "LG", 120, 0.300, 380, 114, 18, 1, 14, 69, 5, 0.988, 2, 154, 6, "타격16위"],
    ["강동우", "한화", 128, 0.302, 506, 153, 30, 2, 10, 48, 27, 0.992, 2, 236, 6, "최다안타5위, 득점7위, 도루9위, 타격12위"]
]

df = pd.DataFrame(data)

df.to_csv("baseball_stats_2009.csv", index=False, encoding="utf-8-sig")