import pandas as pd

data = [
    ["최형우", "삼성", 133, 0.340, 480, 163, 37, 3, 30, 118, 4, 136, 9, 1, 0.993, "홈런 1위, 타점 1위, 장타율 1위, 타율 2위, 출루율 3위, 최다안타 3위, 득점 4위"],
    ["손아섭", "롯데", 116, 0.326, 442, 144, 25, 5, 15, 83, 13, 206, 17, 7, 0.970, "장타율 4위, 타율 5위, 득점 5위, 타점 6위, 최다안타 7위, 출루율 7위"],
    ["전준우", "롯데", 133, 0.301, 539, 162, 38, 5, 11, 64, 23, 223, 13, 2, 0.992, "득점 1위, 최다안타 4위, 도루 공동8위, 장타율 9위, 타율 12위"],
    ["이용규", "KIA", 111, 0.333, 421, 140, 16, 2, 3, 33, 30, 190, 5, 1, 0.995, "득점 2위, 출루율 2위, 타율 4위, 도루 5위, 최다안타 9위"],
    ["이종욱", "두산", 121, 0.303, 436, 132, 11, 5, 5, 44, 20, 188, 4, 4, 0.980, "타율 9위, 최다안타 10위"],
    ["김현수", "두산", 130, 0.301, 475, 143, 25, 2, 13, 91, 5, 231, 10, 5, 0.980, "타점 3위, 출루율 6위, 최다안타 8위, 득점 10위, 타율 11위"],
    ["정수빈", "두산", 128, 0.285, 414, 118, 17, 8, 1, 38, 31, 245, 10, 7, 0.973, "도루 4위, 타율 22위"],
    ["이병규", "LG", 127, 0.338, 485, 164, 24, 0, 16, 75, 2, 218, 6, 1, 0.996, "최다안타 2위, 타율 3위, 장타율 5위, 타점 공동8위"],
    ["강동우", "한화", 133, 0.288, 518, 149, 13, 3, 13, 51, 17, 253, 3, 0, 1.000, "득점 3위, 최다안타 5위, 타율 20위"],
    ["유한준", "넥센", 121, 0.289, 447, 129, 23, 2, 3, 54, 4, 226, 7, 1, 0.996, "타율 19위"]
]

# # CSV 파일로 저장
# filename = "outfielders_stats.csv"
# with open(filename, mode="w", newline="", encoding="utf-8-sig") as file:
#     writer = csv.writer(file)
    
#     # 헤더 작성
#     writer.writerow(["선수명", "소속", "경기", "타율", "타수", "안타", "2루타", "3루타", "홈런", "타점", "도루", "자살", "보살", "실책", "수비율", "비고"])
    
#     # 데이터 작성
#     writer.writerows(players)

# print(f"CSV 파일이 생성되었습니다: {filename}")


columns = ["선수명", "소속", "경기", "타율", "타수", "안타", "2루타", "3루타", "홈런", "타점", "도루", "자살", "보살", "실책", "수비율", "비고"]

df = pd.DataFrame(data, columns=columns)

df.to_csv("baseball_stats_2011.csv", index=False, encoding="utf-8-sig")